# Провести дисперсионный анализ для определения того,
# есть ли различия среднего роста среди взрослых футболистов, хоккеистов и штангистов.
# Даны значения роста в трёх группах случайно выбранных спортсменов:
# Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
# Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
# Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.

import numpy as np
from scipy import stats

ftb = np.array([173, 175, 180, 178, 177, 185, 183, 182])
hck = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180])
wlf = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170])

# H0: μ1 = μ2 = μ3
# H1: H1.1: μ1 = μ2, H1.2: μ1 = μ3, H1.3: μ2 = μ3

alpha = 0.05
k = 3
n1 = len(ftb)
n2 = len(hck)
n3 = len(wlf)
n = n1 + n2 + n3 # 28

ftbMean = np.mean(ftb) # 179.125
hckMean = np.mean(hck) # 178.66666666666666
wlfMean = np.mean(wlf) # 172.72727272727272

totalArray = np.concatenate([ftb, hck, wlf])
# [173 175 180 178 177 185 183 182 177 179 180 188 177 172 171 184 180 172
#  173 169 177 166 180 178 177 172 166 170]

totalMean = np.mean(totalArray) # 176.46428571428572

# S-факторное^2 = ∑ (i = 1 до k) ((yi ̅ - Y ̅ )^2 * ni)
# - факторная сумма квадратов отклонений средних групповых значений от общего среднего, ni - объем выборки

Sf = np.sum((ftbMean - totalMean)**2) * n1 + np.sum((hckMean - totalMean)**2) * n2 +\
      np.sum((wlfMean - totalMean)**2) * n3
print(Sf) # 253.9074675324678

# S-остаточное^2 = ∑ (i = 1 до k)  ∑ (j = 1 до ni) (yij - yi ̅ )^2
# - остаточная сумма квадратов отклонений значений от группового среднего

Sost = np.sum((ftb - ftbMean)**2) + np.sum((hck - hckMean)**2) + np.sum((wlf - wlfMean)**2)
print(Sost) # 577.0568181818182

# сумма квадратнов отклонений наблюдений от общего среднего
sum = np.sum((totalArray - totalMean)**2) # 830.9642857142854

sumS = Sf + Sost # 830.964285714286

# факторная и остаточная дисперсия
varf = Sf / (k - 1) # 126.9537337662339
varost = Sost / (n - k) # 23.08227272727273

# наблюдаемый критерий Фишера
f_emp = varf / varost # 5.500053450812598

# проверка с помощью функции
f_empCheck = stats.f_oneway(ftb, hck, wlf) 
print(f_empCheck) # F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698693)

# табличный критерий
df1 = k - 1
df2 = n - k
f_table = stats.f.ppf(1 - alpha, df1, df2) # 3.3851899614491683

# f_emp > f_table, pvalue < alpha: попадание в область H1
# Вывод: имеются статистически значимые различия в росте футболистов, хоккеистов, штангистов.