# Посчитать коэффициент линейной регрессии при заработной плате (zp),
# используя градиентный спуск (с вычислением intercept).
# Учесть, что изменение коэффициентов должно производиться на каждом шаге одновременно
# (то есть изменение одного коэффициента не должно влиять на изменение другого во время одной итерации).

import numpy as np

zp = np.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110]) # независимая переменная х
ks = np.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832]) # зависимая переменная y

n = len(zp) # 10

# функция потерь
def mse(B0, B1, y = ks, x = zp, n = 10):
    return np.sum((y - B0 + B1 * x)**2) / n

# скорость обучения
alpha = 0.00001

B0 = 0.1
B1 = 0.1

# 3.500.000 итераций с выводом каждой 350.000й итерации + mse
B0new = 0
for i in range(3500000):
    B0new -= alpha * (2/n) * np.sum((B0 + B1 * zp - ks) * 1)
    B1 -= alpha * (2/n) * np.sum((B0 + B1 * zp - ks) * zp)
    B0 = B0new
    if i % 350000 == 0:
        print(f'Iteration = {i}, B0 = {B0}, B1 = {B1}, mse = {mse(B0, B1)}')

# Iteration = 0, B0 = 0.013993199999999999, B1 = 1.6950780000000003, mse = 849069.4025351614
# Iteration = 350000, B0 = 368.9465937162803, B1 = 3.1742705639894635, mse = 563156.0244176196
# Iteration = 700000, B0 = 431.43416039925125, B1 = 2.7143344458625633, mse = 412513.89378042414
# Iteration = 1050000, B0 = 442.0188112710731, B1 = 2.636426735702985, mse = 389502.1392758917
# Iteration = 1400000, B0 = 443.81172528621477, B1 = 2.6232300958587214, mse = 385676.10258494096
# Iteration = 1750000, B0 = 444.1154236041468, B1 = 2.620994741966002, mse = 385030.07988940505
# Iteration = 2100000, B0 = 444.16686648849134, B1 = 2.6206160995930206, mse = 384920.71050140983
# Iteration = 2450000, B0 = 444.17558030148786, B1 = 2.6205519620767683, mse = 384902.1863252876
# Iteration = 2800000, B0 = 444.1770563178105, B1 = 2.6205410979440495, mse = 384899.0485988039
# Iteration = 3150000, B0 = 444.1773063374298, B1 = 2.620539257689111, mse = 384898.51710663433

# B1 и mse прекращают изменения на 3150000-й итерации
# получили модель: ks = 444.18 + 2.62 * zp

# проверка:
checkIt = mse(444.18, 2.62)
print(checkIt) # 384817.78495999996